# 元组，元组访问元素与列表相同都是通过下标来访问，他们的区别是列表定义的元素是可以修改的，而元组定义的元素是不可修改的
name1 = (1, 2, 3, 4)
print(name1[1])
print("-------------------------------------------------")

# 遍历元组 遍历元组的方式与列表类似
for i in name1:
    print(i)
print("-------------------------------------------------")
# 修改元组变量
name2 = ("宫保鸡丁", "糖醋鱼")
print(name2)
print("-------------------------------------------------")
name2 = ("清炒时蔬", "水煮鱼")
for i in name2:
    print(i)
print("-------------------------------------------------")
